Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_vpc.tenant_vpc is tainted, so must be replaced
-/+ resource "aws_vpc" "tenant_vpc" {
      ~ arn                              = "arn:aws:ec2:us-east-1:027056559285:vpc/vpc-063eecc98d41aba9c" -> (known after apply)
        assign_generated_ipv6_cidr_block = false
        cidr_block                       = "10.126.150.0/24"
      ~ default_network_acl_id           = "acl-04658fd7945a89566" -> (known after apply)
      ~ default_route_table_id           = "rtb-0269254c5e10fe0b6" -> (known after apply)
      ~ default_security_group_id        = "sg-08937a7a2dc5a39d3" -> (known after apply)
      ~ dhcp_options_id                  = "dopt-afa69ed4" -> (known after apply)
      ~ enable_classiclink               = false -> (known after apply)
      ~ enable_classiclink_dns_support   = false -> (known after apply)
      ~ enable_dns_hostnames             = false -> (known after apply)
        enable_dns_support               = true
      ~ id                               = "vpc-063eecc98d41aba9c" -> (known after apply)
        instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      ~ main_route_table_id              = "rtb-0269254c5e10fe0b6" -> (known after apply)
      ~ owner_id                         = "027056559285" -> (known after apply)
      ~ tags                             = {
          + "Name" = "tenant2"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.205.62.16/lock?id=peterdyer7%252Fatlantistest%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
